Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: གང་གིས་འཆིང་རྣམས་ཡང་དག་རབ་བཅད་ཅིང་། །མུ་སྟེགས་ཚོགས་རྣམས་ཐམས་ཅད་རབ་བཅོམ་སྟེ། །སྡེ་དང་བཅས་པའི་བདུད་རྣམས་ངེས་བཅོམ་ནས། །བྱང་ཆུབ་འདི་བརྙེས་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to he who severed the bonds, Destroyed the whole host of tīrthikas, Vanquished the armies of Māra, And thus discovered this awakening.

source: རྒྱ་གར་སྐད་དུ།
en: In the language of India,

source: བི་ན་ཡ་བསྟུ།
en: Vinayavastu.

source: བོད་སྐད་དུ།
en: In the language of Tibet,

source: འདུལ་བ་གཞི།
en: Dulwa Shi

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: ཁྱིམ་དོན་ཆེ་ཆུང་སྤངས་ཏེ་དང་པོར་རབ་འབྱུང་དཀའ། །
en: At first to renounce a householder’s concerns and go forth is hard.

source: རབ་བྱུང་ཐོབ་ནས་ཡུལ་སྤྱད་དག་གིས་དགའ་ཐོབ་དཀའ། །
en: For a hedonist to be happy among renunciants is hard.

source: མངོན་དགའ་ཇི་བཞིན་དོན་བསྐྱེད་ཡང་དག་བྱེད་པ་དཀའ། །
en: For the joyful set on perfection to act perfectly is hard.

source: ངུར་སྨྲིག་གོས་འཆང་མཁས་པ་ཚུལ་ལས་ཉམས་པ་དཀའ། །
en: For a learned wearer of the saffron robes to fall is hard.

source: གཞི་རྣམས་ཀྱི་སྤྱི་སྡོམ་ལ། རབ་འབྱུང་གསོ་སྦྱོང་གཞི་དང་ནི། །
en: The Chapters on Monastic Discipline includes chapters on: Going forth, purification,

source: དགག་དབྱེ་དབྱར་དང་ཀོ་ལྤགས་གཞི། །
en: Lifting restrictions, the rains, leather,

source: སྨན་དང་གོས་དང་སྲ་བརྐྱང་དང་།
en: Medicine , robes, turning cloth into robes,

source: ཀཽ་ཤཱམ་བཱི་དང་ལས་ཀྱི་གཞི། །
en: The monks of Kauśāmbī, formal acts of saṅgha,

source: དམར་སེར་ཅན་དང་གང་ཟག་དང་། །
en: A group of troublesome monks, types of persons,

source: སྤོ་དང་གསོ་སྦྱོང་བཞག་པ་དང་། །
en: Demotions, suspension of the purification,

source: གནས་མལ་དང་ནི་རྩོད་པ་དང་། །དགེ་འདུན་དབྱེན་རྣམས་བསྡུས་པ་ཡིན། །
en: Housing, disputes, and schisms in the saṅgha.

source: རབ་ཏུ་འབྱུང་བའི་གཞིའི་སྤྱི་སྡོམ་ལ།
en: The whole of The Chapter on Going Forth

source: སྡེ་ཚན་ཡང་དག་བསྡུས་པ་ཡིན།
en: Is told in sections on:

source: ཤཱ་རིའི་བུ་དང་མུ་སྟེགས་ཅན། །
en: Śāriputra , tīrthikas

source: དགེ་ཚུལ་གཉིས་དང་བྱ་རོག་སྐྲོད། །
en: The two novices , scaring a crow

source: དགྲ་བཅོམ་བསད་དང་ལག་རྡུམ་གྱི། །
en: Killing an arhat , and missing hands

source: ལྔ་པའི་སྡེ་ཚན་བསྡུས་པ་ཡིན།
en: The Śāriputra section is told over five chapters:

source: ཤཱ་རིའི་བུ་དང་རབ་འབྱུང་དང་། །
en: Śāriputra , going forth

source: བསྙེན་པར་རྫོགས་པར་གནང་བ་དང་། །
en: Granting Ordination

source: ཉེ་སྡེས་ཚོགས་ནི་བསྡུས་པ་དང་། །
en: querying Upasena, and a summary.

source: བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ན། །
en: While the Bodhisattva was dwelling in the Abode of Tuṣita,

source: ཡུལ་ཨང་ག་དག་ན་ཨང་གའི་རྒྱལ་པོ་ཞེས་བྱ་བས་རྒྱལ་སྲིད་འབྱོར་པ། རྒྱས་པ་བདེ་བ་ལོ་ལེགས་པ་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་བྱེད་དུ་བཅུག་གོ།
en: the King of Aṅga ruled over the lands of Aṅga. Under his rule, the kingdom prospered and thrived, crops were bountiful and the land teemed with animals and people.

source: སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་བྱེད་དུ་བཅུག་གོ།
en: and the land teemed with animals and people.

source: ཡུལ་མ་ག་དྷཱ་དག་ན་ཡང་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ཞེས་བྱ་བས། རྒྱལ་སྲིད་འབྱོར་པ་རྒྱས་པ་བདེ་བ་ལོ་ལེགས་པ་
en: Meanwhile, King Mahāpadma ruled over the lands of Magadha. Under his rule, the kingdom prospered and thrived, crops were bountiful

source: རེས་འགའ་ནི་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བ་ཡིན་ལ། །
en: At times, the King of Aṅga and his armies were dominant.

source: རེས་འགའ་ནི་རྒྱལ་པོ་པད་མ་ཆེན་པོ་དཔུང་དང་མཐུ་ཆེ་བ་ཡིན་ནོ། །
en: At other times, King Mahāpadma and his armies were dominant.

source: གང་གི་ཚེ་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བ་དེའི་ཚེ་ན།
en: At a time when the King of Aṅga and his armies were dominant,

source: དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ།
en: he called up the four branches of his armed forces

source: གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་རྒྱལ་པོའི་ཁབ་མ་གཏོགས་པ་བཅོམ་ནས་ཕྱིར་ལྡོག་པར་བྱེད་དོ།
en: —the elephant corps, the cavalry, the charioteer corps, and the infantry—and laid waste to all of Magadha, save Rājagṛha, before returning.

source: གང་གི་ཚེ་རྒྱལ་པོ་པད་མ་ཆེན་པོ་དཔུང་དང་མཐུ་ཆེ་བ་དེའི་ཚེ་ན། །
en: At a time when King Mahāpadma and his armies were dominant,

source: དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ།
en: he too called up the four branches of his armed forces

source: གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་ཨང་ག་ཙམ་པ་མ་གཏོགས་པ་བཅོམ་ནས་ཕྱིར་ལྡོག་པར་བྱེད་དོ། །
en: —the elephant corps, the cavalry, the charioteer corps, and the infantry—and laid waste to all of Aṅga, save Campā, before returning.

source: དེ་ནས་དུས་གཞན་ཞིག་ན་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བར་གྱུར་ནས།
en: At yet another time when the King of Aṅga and his armies were dominant,

source: དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་གཞོམ་པར་བརྩམས་པ་དང་།
en: he again called up the four branches of his armed forces—the elephant corps, the cavalry, the charioteer corps, and the infantry—and began again to lay waste to the land of Magadha,

source: མ་ག་དྷཱ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ལ་ལྷ་ཨང་གའི་རྒྱལ་པོས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་འཇོམས་པར་བགྱིད་དོ་ཞེས་སྦྲོན་པ་དག་བཏང་ངོ་།
en: prompting the people of Magadha to send a message to King Mahāpadma, saying, “Your Majesty, the King of Aṅga has called up the four branches of his armed forces—the elephant corps, the cavalry, the charioteer corps, and the infantry—and is laying waste to the lands of Magadha.”

source: རྒྱལ་པོ་པད་མ་ཆེན་པོས་ཀྱང་ཐོས་ནས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ།
en: When King Mahāpadma heard this, he too called up the four branches of his armed forces—the elephant corps, the cavalry, the charioteer corps, and the infantry

source: ཨང་གའི་རྒྱལ་པོ་དང་གཡུལ་སྤྲད་པའི་ཕྱིར་འཕགས་སོ། །
en: —and rode out to meet the King of Aṅga in battle.

source: དེ་ནས་ཨང་གའི་རྒྱལ་པོས་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གླང་པོ་ཆེ་པའི་ཚོགས་ཐམས་ཅད་ཕྲོགས་ཤིང་།
en: The King of Aṅga captured King Mahāpadma’s entire elephant corps

source: རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་ཐམས་ཅད་ཀྱང་ཕྲོགས་སོ།
en: and proceeded to capture the whole of his cavalry, charioteer corps, and infantry.

source: རྒྱལ་པོ་པད་མ་ཆེན་པོ་ཡང་ཕམ་པ་དང་། སྐྲག་པ་དང་། བཅོམ་པ་དང་། གཞན་རྒྱལ་བ་དང་། རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱས་ཏེ། །
en: Defeated and frightened, destroyed and conquered, King Mahāpadma retreated.

source: རྒྱལ་པོའི་ཁབ་ཏུ་ཞུགས་ནས་སྒོ་བཅད་དེ། ར་བ་དག་གི་ཁར་སྦྲེངས་ནས་འདུག་གོ། །
en: Entering Rājagṛha, he closed the gates and shut himself up within the walls of his fortress.

source: ཨང་གའི་རྒྱལ་པོས་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: The King of Aṅga sent an envoy to King Mahāpadma with the message,

source: གལ་ཏེ་ཕྱིར་འབྱུང་ན་དེ་ལྟ་ན་ལེགས། །
en: “It would be good were you to come out.

source: གལ་ཏེ་ཕྱིར་མི་འབྱུང་ན་ཇི་སྟེ་སྟེང་གི་ནམ་མཁའ་ལ་འགྲོ་ན་ནི་མདའ་བརྒྱུད་པས་ཁྱོད་ལྟུང་བར་བྱའོ།
en: If you do not surrender, and instead take flight into the sky above, I will fell you with a volley of arrows.

source: ཇི་སྟེ་སའི་འོག་ཏུ་འགྲོ་ན་ནི་མཆིལ་པ་དང་དྲང་བའི་ཚུལ་གྱིས་དྲང་བར་བྱའོ།
en: Tunnel beneath the earth and I will yank you up as if with a hook.

source: ཇི་སྟེ་རིའི་རྩེ་མོར་འཛེག་ན་ནི་དེར་ཡང་ཁྱོད་ཐར་པ་མེད་དོ་ཞེས་སྤྲིང་ངོ་། །
en: Flee to the mountaintops, and even there you shall find no escape.”

source: རྒྱལ་པོ་པད་མ་ཆེན་པོས་ཕྲིན་ཡིག་བཀླགས་ནས་དེ་མི་བདེ་བར་གྱུར་ཏེ། །
en: King Mahāpadma was unsettled by the message he heard.

source: ལག་པ་ལ་འགྲམ་པ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་འདུག་ནས། །
en: Head in hands, he sat and sat, absorbed in thought.

source: དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: Then he said to his ministers,

source: ཤེས་ལྡན་དག་ཨང་གའི་རྒྱལ་པོ་འདི་ནི་གདུག་པ། །
en: “Gentlemen , this King of Aṅga is belligerent,

source: ཕ་རོལ་གནོན་པ།
en: ruthless,

source: དཔུང་དང་མཐུ་ཆེ་བར་གྱུར་ལ།
en: and his military might is great.

source: དེས་ཡུ་བུ་ཅག་ལ་འདི་དང་འདི་སྐད་ཅེས་སྤྲིང་ན། དེ་ལ་ཡུ་བུ་ཅག་གིས་ཇི་ལྟར་བསྒྲུབ་པར་བྱ། །
en: If he gives an order, how can we not obey?”

source: དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་སྨྲས་པ།
en: They spoke in verse:

source: ཡུལ་དང་སྲོག་ལ་གནོད་གྱུར་ན། །
en: “When land and life are threatened,

source: སྐྱེས་བུས་ཀུན་དུ་སྲོག་བསྲུང་བྱ། །
en: Seek always to protect life.

source: བློ་ཡིས་གཉིས་ཀ་དཔྱད་བྱས་ན། །
en: When the wise look at both,

source: ཡུལ་ནི་ཡང་རྙེད་སྲོག་རྣམས་མིན། །
en: they see Land, but not life, can be found again.”

source: དེ་རལ་གྲི་མགུལ་དུ་ཐོགས་ཏེ་ཕྱིར་བྱུང་བ་དང་།
en: King Mahāpadma hung his sword from his neck in surrender and went out,

source: ཨང་གའི་རྒྱལ་པོས་དེ་ལ་ལོ་ཐང་དང་དཔྱ་ཕབ་སྟེ་དེ་ཉིད་དུ་བཞག་གོ། །
en: where the King of Aṅga imposed an annual tribute and tax upon him.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པས་
en: While the blessed Bodhisattva was dwelling in the Abode of Tuṣita,

source: གཟིགས་པ་ལྔ་པོ་དག་ལ་གཟིགས་ནས་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དྲུག་པོ་དག་ལ་ལན་གསུམ་བསྒོ་བ་མཛད་དེ།
en: he saw five sights and thrice gave notice to the six classes of gods who revel in the desire realm.

source: གླང་པོ་ཆེ་ལྟར་སྣང་བར་བསྒྱུར་ཏེ།
en: Assuming an elephant’s appearance,

source: ཡུམ་གྱི་ལྷུམས་སུ་ཞུགས་པ་དེའི་ཚེ་ན་ས་ཆེན་པོ་ཤིན་ཏུ་གཡོས་པར་གྱུར་ཅིང་འཇིག་རྟེན་འདི་
en: he entered his mother’s womb as the earth shook and this world

source: ཐམས་ཅད་ཀྱང་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཁ་དོག་གི་མཐུ་བས་ལྷག་པའི་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཅིང་།
en: and all others too were bathed in a vast light more luminous than the glow of the gods of the Thirty-Three.

source: འཇིག་རྟེན་གྱི་འཇིག་རྟེན་གྱི་བར་གང་ན་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ཀྱི་འོད་དག་ཉམས་སུ་མི་མྱོང་བའི་མུན་པ་མུན་གནག་མུན་པར་བྱེད་པས།
en: So great was this miraculous manifestation, it was as if the sun and moon shone in the gulf between worlds. So great was its strength that darkness everywhere,

source: གནག་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་དེའི་ཚེ་ན་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ནས།
en: even the pitch-black darkness of dark places dark from never knowing the light of the sun and moon, was filled with a vast light.

source: སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དག་གིས་རང་གི་ལག་པ་བརྐྱང་བ་ཡང་མི་ མཐོང་བ་དེ་དག་གིས་ཀྱང་འོད་དེས་སེམས་ཅན་གཅིག་གིས་གཅིག་མཐོང་ནས་ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ།
en: Beings born in those places had never even seen so far as their outstretched hands, yet by this light these beings saw one another and exclaimed, “You there! There are others who have been born here!

source: ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ་ཞེས་ཤེས་པར་གྱུར་ཏོ།
en: There are others who have been born here!”

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་པ་དེའི་ཚེ་ན་
en: At the same time as the blessed Bodhisattva was born,

source: གྲོང་ཁྱེར་ཆེན་པོ་བཞི་པོ་དག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་གི་བུ་ཡང་བཙས་པར་གྱུར་ཏེ། །
en: sons were also born to four great kings in four great city-states.

source: རྒྱལ་པོའི་ཁབ་ཏུ་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་བུ་བཙས་སོ། །
en: In Rājagṛha the son of King Mahāpadma was born.

source: མཉན་ཡོད་དུ་ནི་རྒྱལ་པོ་རྩིབས་ཀྱིས་འཕུར་ཚངས་བྱིན་གྱི་བུ་བཙས་སོ། །
en: In Śrāvastī the son of King Arāḍa Brahmadatta was born.

source: འཕགས་རྒྱལ་དུ་ནི་རྒྱལ་པོ་མུ་ཁྱུད་མཐའ་ཡས་ཀྱི་བུ་བཙས་སོ། །
en: In Ujjayinī the son of King Anantanemi was born.

source: ཀཽ་ཤཱམ་བཱིར་ནི་རྒྱལ་པོ་དམག་བརྒྱ་པའི་བུ་བཙས་སོ། །
en: In Kauśāmbī the son of King Śatānīka was born.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་པ་ན་
en: When the blessed Bodhisattva was born,

source: འཇིག་རྟེན་ཐམས་ཅད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཁ་དོག་གི་མཐུ་བས་ལྷག་པའི་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཅིང་
en: the entire universe was bathed in a vast light more luminous than the glow of the gods of the Thirty-Three.

source: འཇིག་རྟེན་གྱི་འཇིག་རྟེན་གྱི་བར་གང་ན་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ།
en: So great was this miraculous manifestation, it was as if the sun and moon shone in the gulf between worlds.

source: འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ཀྱི་འོད་དག་ཉམས་སུ་མི་མྱོང་བའི་མུན་པ་མུན་གནག་མུན་པར་བྱེད་པས་གནག་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་དེའི་ཚེ་ན་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ ནས། །
en: So great was its strength that darkness everywhere, even the pitch-black darkness of dark places dark from never knowing the light of the sun and moon, was filled with a vast light.

source: སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དག་གིས་རང་གི་ལག་པ་བརྐྱང་བ་ཡང་མི་མཐོང་བ་
en: Beings born in those places had never even seen so far as their outstretched hands,

source: དེ་དག་གིས་ཀྱང་འོད་དེས་སེམས་ཅན་གཅིག་གིས་གཅིག་མཐོང་ནས་ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ། །
en: yet by this light these beings saw one another and exclaimed, “You there! There are others who have been born here!

source: ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ་ཞེས་ཤེས་པར་གྱུར་ཏོ། །
en: There are others who have been born here!”

source: རྒྱལ་པོ་པད་མ་ཆེན་པོས་བསམས་པ།
en: King Mahāpadma thought,

source: བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་ཉི་མའི་གཟུགས་ཤར་བ་ལྟར་སྣང་ཞིང་
en: “When my son was born, the world was lit as if by the gold of the rising sun.

source: འདི་བཙུན་མོ་གཟུགས་ཅན་གྱི་བུ་ཡིན་པས་
en: And as he is the son of Queen Bimbī (Goldie),

source: གཞོན་ནུ་འདིའི་མིང་གཟུགས་ཅན་སྙིང་པོར་གདགས་སོ་སྙམ་ནས་
en: I shall name this prince Bimbisāra (Essence of Gold).”

source: བུ་དེའི་མིང་གཟུགས་ཅན་སྙིང་པོ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: And so the boy was named Bimbisāra.

source: རྒྱལ་པོ་རྩིབས་ཀྱིས་འཕུར་ཚངས་བྱིན་གྱིས་བསམས་པ།
en: King Arāḍa Brahmadatta thought,

source: བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་གསལ་བ་གསལ་བ་ལྟར་སྣང་བས་
en: “When my son was born, the world was lit as if by the light of lights,

source: གཞོན་ནུ་འདིའི་མིང་གསལ་རྒྱལ་དུ་གདགས་སོ་སྙམ་ནས་
en: so I shall name this prince Prasenajit (Supreme Light).”

source: བུ་དེའི་མིང་གསལ་རྒྱལ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: And so the boy was named Prasenajit.

source: རྒྱལ་པོ་དམག་བརྒྱ་པས་བསམས་པ།
en: King Śatānīka thought,

source: བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་ཉི་མ་ཤར་བ་ལྟར་སྣང་བར་གྱུར་པས་གཞོན་ནུ་འདིའི་མིང་ཤར་བར་གདགས་སོ་སྙམ་ནས་
en: “When my son was born, the world was lit as if by the rising sun, so I shall name this prince Udayana (Rising).”

source: བུ་དེའི་མིང་ཤར་བ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: And so the boy was named Udayana.

source: རྒྱལ་པོ་མུ་ཁྱུད་མཐའ་ཡས་ཀྱིས་བསམས་པ།
en: King Anantanemi thought,

source: བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་རབ་ཏུ་སྣང་བས་སྣང་བར་གྱུར་པས་གཞོན་ནུ་འདིའི་མིང་རབ་སྣང་ཞེས་བྱ་བར་གདགས་སོ་སྙམ་ནས་
en: “When my son was born, the world was lit by a brilliant light, so I shall name this prince Pradyota (Brilliant Light).”

source: བུ་དེའི་མིང་རབ་སྣང་ཞེས་བྱ་བར་བཏགས་སོ། །
en: And so the boy was named Pradyota.

source: རྒྱལ་པོ་རེ་རེས་བསམས་པ་ཡང་བདག་གི་བུ་འདིའི་མཐུ་ཡིན་ནོ།
en: And so each king attributed the light to the birth of his own son.

source: བདག་གི་བུ་འདིའི་མཐུ་ཡིན་ནོ་སྙམ་མོད་ཀྱི།
en: Though each attributed it to his own son,

source: དེ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ།
en: it was not so.

source: འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཡིན་པའི་ཕྱིར་རོ། །
en: For all that occurred, occurred because of the Bodhisattva.

source: གང་གི་ཉིན་མོ་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་བཙས་པ་དེ་ཉིད་ཀྱི་ཉིན་མོ་
en: On the very same day that Prince Bimbisāra was born,

source: བློན་པོ་ལྔ་བརྒྱ་དག་གི་བུ་ལྔ་བརྒྱ་ཡང་བཙས་ཏེ།
en: five hundred sons of five hundred ministers were also born

source: དེ་དག་ཀྱང་རིགས་དང་མཐུན་པར་མིང་བཏགས་སོ།
en: and were given names appropriate to their patrilineage.

source: གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་མ་མ་བརྒྱད་པོ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་། དྲི་མ་འཕྱི་བའི་མ་མ་གཉིས་དང་། རྩེན་གྲོགས་ཀྱི་མ་མ་གཉིས་ལ་རྗེས་སུ་གཏད་དོ། །
en: Prince Bimbisāra was entrusted to eight nursemaids: two to cuddle him, two to breastfeed him, two to change his diapers, and two to play with him.

source: དེ་མ་མ་བརྒྱད་པོ་དག་གིས་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་སྙིང་ཁུ་དང་། གཞན་ཡང་ཡོ་བྱད་ཀྱི་བྱེ་བྲག་གཙོ་བོ་གཙོ་བོ་དག་གིས་སྲིང་བར་བྱེད། །
en: Fortified with milk, curd, butter, ghee, cream, and other nourishing foods,

source: སྐྱེད་པར་བྱེད་ཅིང་རྫིང་ན་གནས་པའི་པད་མ་བཞིན་མྱུར་དུ་སྐྱེད་པར་བྱེད་དོ། །
en: he grew quickly, shooting up like a lotus in a pond.

source: དེ་གང་གི་ཚེ་ཆེན་པོར་གྱུར་པ་དེའི་ཚེ་
en: When he was old enough,

source: ཡི་གེ་དང་། གྲངས་དང་། རྩིས་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། གཞུག་པ་དང་། གཞག་པ་ལ་ཉེ་བར་ཞུགས་ནས།
en: he was introduced to letters, number names, calculation, counting by hand, expenditures, revenues, and deposits.

source: དེ་ཡི་གེའི་མཐར་ཕྱིན་ཅིང་འབྱེད་པ་དང་། ཀློག་པ་དང་། མཁས་པ་དང་། སྐྱོད་པ་གསལ་བ་དང་། བརྟག་པ་བརྒྱད་པོ་འདི་ལྟ་སྟེ། རིན་པོ་ཆེ་བརྟག་པ་དང་། གཞི་བརྟག་པ་དང་། གོས་བརྟག་པ་དང་། ཤིང་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། བུད་མེད་བརྟག་པ་དང་། སྐྱེས་པ་བརྟག་པ་ལ་མཁས་པར་གྱུར་ཏོ།
en: After he mastered letters, he became skilled in exegesis, reading, knowledge, proper conduct, and the way to assess gems, sites, fabrics, woods, elephants, horses, women, and men.

source: ཤིང་རྟའི་ཐབས་དང་། རལ་གྲིའི་ཐབས་དང་།
en: charioteering, swordsmanship,

source: འཕོང་དང་། ཕྱིར་བསྣུར་བ་དང་།
en: archery, advancing,

source: མདུན་དུ་བསྣུར་བ་དང་། ལྕགས་ཀྱི་བསྒྱུར་ཐབས་དང་།
en: yielding, wielding a hook,

source: ཞགས་པ་གདབ་པ་དང་། མདའ་བོ་ཆེ་འཕེན་ཐབས་དང་།
en: throwing a lasso, casting a spear,

source: འཛིན་སྟངས་དང་། གོམ་སྟངས་དང་། ཐོར་ཚུགས་དང་།
en: and how to hold a weapon, march, tie a topknot,

source: གཅད་པ་དང་། དྲལ་བ་དང་། དབུག་པ་དང་། གནས་ལྔ་པོ་འདི་ལྟ་སྟེ། རྒྱང་ནས་འཕོག་པ་དང་། སྒྲ་གྲགས་པར་འཕོག་པ་དང་། གནད་དུ་འཕོག་པ་དང་། མི་འཆོར་བར་འཕོག་པ་དང་། ཚབས་ཆེ་བ་
en: slash, quarter, pierce, and strike in five ways—striking from a distance, striking a target using acoustic location, striking a fatal blow, striking without hesitation, and striking forcefully.

source: བློན་པོའི་བུ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་དག་ལ་བྱང་བར་གྱུར་ཏོ། །
en: These arts and skills were also mastered by the five hundred sons of the five hundred ministers.

source: དེ་ཕས་བཟོ་སྦྱང་བ་བཅྭ་བརྒྱད་པོ་དག་ལ་བཅུག་ནས་དེའི་མིང་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ། བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Bimbisāra’s father enrolled him in the eighteen guilds, due to which he was named and became known as Bimbisāra of the Guilds.

source: དེ་ནས་དུས་གཞན་ཞིག་ན་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་གླང་པོ་ཆེ་ལ་ཞོན་ཏེ་ལྗོངས་སུ་བྱུང་བ་དང་།
en: Later Prince Bimbisāra ventured into the countryside astride an elephant

source: དེས་ཨང་གའི་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་དག་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་མཐོང་ནས། དེས་སྨྲས་པ།
en: where he saw the King of Aṅga’s officers collecting tributes and taxes, prompting him to inquire of his men,

source: ཤེས་ལྡན་དག་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་འདི་དག་སུའི་ཡིན།
en: “Gentlemen , for whom are these tributes and taxes being collected?”

source: ལྷ་ཨང་གའི་རྒྱལ་པོའི་ལགས་སོ།
en: “Your Majesty! For the King of Aṅga.”

source: ཅི་ཡུ་བུ་ཅག་དེ་ལ་ལོ་ཐང་འབུལ་བ་ཡིན་ནམ། །
en: “What? Will we be offered tribute?”

source: ལྷ་ལོ་ཐང་འབུལ་བ་ལགས་སོ།
en: “No, Your Majesty, we are the ones to offer the tribute.”

source: ཤེས་ལྡན་དག་ཞོ་ཤས་འཚོ་བ་དེ་དག་བོས་ཤིག
en: “Gentlemen , summon those officers.”

source: དེ་དག་གིས་བོས་པ་དང་། དེས་སྨྲས་པ།
en: When the officers were summoned, he said,

source: ཤེས་ལྡན་དག་དེ་ཡང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ཡིན་ལ།
en: “Gentlemen, the King of Aṅga has been crowned and anointed a kṣatriya king.

source: ངེད་ཀྱང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ཡིན་ན།
en: If I too have been crowned and anointed a kṣatriya king,

source: ཅིའི་ཕྱིར་ཁྱེད་ཅག་ལོ་ཐང་དང་དཔྱ་སྡུད་པར་བྱེད།
en: why is it you are collecting tributes and taxes here?

source: དེང་ལ་ཕྱིན་ཆད་ལོ་ཐང་དང་དཔྱ་མ་སྡུད་ཅིག
en: I forbid you to collect tributes and taxes from this day forth.”

source: དེ་དག་གིས་བསམས་པ། གཞོན་ནུ་འདི་ནི་རྒྱུས་མི་ཤེས་པ་ཡིན་པས་བདག་ཅག་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གན་དུ་འདོང་ཞིང་སོང་ནས་བསྙད་པར་བྱའོ་སྙམ་ནས། །
en: “The prince fails to appreciate the situation,” they thought. “Let us go submit the matter to King Mahāpadma.”

source: དེ་དག་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གན་དུ་སོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ།
en: They went to King Mahāpadma and said,

source: ལྷ་བདག་ཅག་ཨང་གའི་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་ན་
en: “Your Majesty, when we officers of the King of Aṅga were collecting tributes and taxes,

source: གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོས་བཀག་ན།
en: Prince Bimbisāra stopped us from doing so.

source: ཅི་བསྡུ་བར་འཚལ་ལམ། འོན་ཏེ་སླར་མཆི་བར་འཚལ། །
en: Shall we collect them or not?”

source: ཤེས་ལྡན་དག་གཞོན་ནུ་དེ་ནི་རྒྱུས་མི་ཤེས་པ་ཡིན་པས་ཁྱེད་ཅག་སྔོན་ཇི་ལྟར་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་དེ་བཞིན་དུ་སྡུས་ཤིག
en: “Gentlemen , the prince doesn’t understand the situation. Continue to collect tributes and taxes as you have done before.”

source: དེ་དག་གིས་ཡང་བསྡུ་བར་བརྩམས་ཏེ།
en: They had begun their collection again

source: དེ་དག་འོངས་ནས་ཕྱིར་ལྡོག་པ་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོས་མཐོང་ནས་སྨྲས་པ།
en: when Prince Bimbisāra spotted them on their way back from the countryside and said,

source: ཤེས་ལྡན་དག་ངས་ཁྱེད་ལ་ཕྱིན་ཆད་ལོ་ཐང་དང་དཔྱ་མ་སྡུད་ཅིག་ཅེས་མ་བཟློག་གམ།
en: “Gentlemen , have I not already prohibited you from collecting tributes and taxes?

source: ཅིའི་ཕྱིར་ཡང་ཁྱེད་ལོ་ཐང་དང་དཔྱ་སྡུད།
en: Why are you collecting them again?

source: གལ་ཏེ་རེ་ཞིག་འཁོད་ན་དེ་ལྟ་ན་ལེགས། གལ་ཏེ་མི་འཁོད་ན་མཚམས་ཆེན་པོ་གཅད་པར་བྱའོ། །
en: You are to desist. Fail to desist and I shall close the borders.”

source: དེ་དག་སྐྲག་ནས་བསམས་པ།
en: Frightened, they thought,

source: གཞོན་ནུ་འདི་ནི་གདུག་པ་ཕ་རོལ་གནོན་པ་ཡིན་པས་
en: “The prince is dangerous and ruthless.

source: བདག་ཅག་ལ་གནོད་པ་བྱེད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ལྟ་བུའི་གནས་ཡོད་པར་འགྱུར་གྱིས།
en: In time he may pose a serious risk to us.

source: བདག་ཅག་ཨང་གའི་རྒྱལ་པོའི་གན་དུ་དོང་སྟེ་སྦྲན་པར་བྱའོ་སྙམ་ནས་
en: We must go warn the King of Aṅga.”

source: དེ་དག་ཨང་གའི་རྒྱལ་པོའི་གན་དུ་དོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ།
en: They went before the King of Aṅga and said,

source: ལྷ་བདག་ཅག་ལྷའི་ཞོ་ཤས་འཚོ་བ་ལགས་ཏེ།
en: “Your Majesty, as officers of the court,

source: བདག་ཅག་ལྷའི་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་ན་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་བུ་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་དེས་བཟློག་ལགས་ན།
en: we were collecting tributes and taxes on your behalf when King Mahāpadma’s son, Prince Bimbisāra, stopped us.

source: ད་གལ་ཏེ་ལྷས་བཏང་སྙོམས་མཛད་ན་
en: If Your Majesty ignores the prince’s actions,

source: སླད་ཀྱིས་གནོད་པ་ཆེན་པོ་བགྱིད་པར་འགྱུར་བ་གང་ལགས་པ་དེ་ལྟ་བུའི་གནས་མཆིས་པར་འགྱུར་རོ། །
en: he may, in time, pose a serious risk to us.”

source: ཚིགས་སུ་བཅད་པ་ཡང་སྨྲས་པ།
en: Then they spoke in verse:

source: ཇི་སྲིད་ཤིང་ནི་གཞོན་པའི་ཚེ། །སེན་མོ་དག་གིས་གཅད་ནུས་པ། །
en: “When a tree is small, Fingernails may fell it.

source: དེ་ཉིད་ཆེན་པོར་སྐྱེས་པ་ན། །
en: Yet when the tree is large,

source: སྟ་རེ་བརྒྱས་ཀྱང་གཅད་པར་དཀའ།
en: Even a hundred axes may fail.”

source: ཨང་གའི་རྒྱལ་པོས་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ལ་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་མགུལ་པ་ནས་ཐོགས་ལ་ཚུར་བཀྲི་བའམ།
en: The King of Aṅga sent a letter to King Mahāpadma: “Send Prince Bimbisāra with his sword hung from his neck

source: ཡང་ན་རྩྭ་དང་ཆས་སྟ་གོན་གྱིས་ཤིག་དང་། ང་ཉིད་འོ་ནིར་འོང་ངོ་ཞེས་ཕྲིན་ཡིག་སྤྲིང་ངོ་།
en: —or prepare your pyre and shroud, for I myself will come!”

source: རྒྱལ་པོ་པད་མ་ཆེན་པོས་ཕྲིན་ཡིག་བཀླགས་ནས་དེ་མི་བདེ་བར་གྱུར་ཏེ་ལག་པ་འགྲམ་པ་ལ་གཏད་ནས། །
en: King Mahāpadma heard this letter read and was troubled. Head in hands,

source: སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་འདུག་ནས། །
en: he sat and sat, absorbed in thought.

source: དེས་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་བོས་ནས་སྨྲས་པ།
en: Then he summoned Prince Bimbisāra and said,

source: ཅིའི་ཕྱིར་ཁྱོད་ཀྱིས་ཨང་གའི་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་དག་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་ཟློག།
en: “Son, why did you stop the King of Aṅga’s officers from collecting tributes and taxes?

source: དེས་ཁྲོས་ཏེ་ང་ལ་འདི་དང་འདི་སྐད་ཅེས་སྤྲིང་ངོ་།
en: They have sent me a letter expressing their anger.”

source: ལྷ་ཅི་སྐོལ་དེ་ལ་ལོ་ཐང་འབུལ་བ་ལགས་སམ།
en: “Your Majesty, why do we pay tribute and taxes to him?”

source: བུ་ལོ་ཐང་འབུལ་བ་ཡིན་ནོ།
en: “Son, we are tributaries.”

source: ལྷ་དེ་ཡང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ལགས་ལ། །
en: If the King of Aṅga has been crowned and anointed a kṣatriya king

source: སྐོལ་ཀྱང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ལགས་ན།
en: and we too have been crowned and anointed kṣatriya kings,

source: ཅིའི་སླད་དུ་སྐོལ་དེ་ལ་ལོ་ཐང་དང་དཔྱ་འབུལ།
en: why do we offer tribute and taxes to him?
